In [3]:
import numpy as np
import pandas as pd

In [ ]:
create an inner join which gives three rows

In [5]:
d1=pd.DataFrame{[1,2,3],[3,4,5]}

SyntaxError: invalid syntax (1914366541.py, line 1)

In [6]:
a1={
    'student':['Deepesh','Dinesh','Jaison','sai','pratham'],
    'usn':[101,102,103,104,105]
}
a2={
    'usn':[101,102,103],
    'marks':[56,57,58]    
}

In [7]:
df1=pd.DataFrame(a1)
df2=pd.DataFrame(a2)

In [27]:
df1

   student  usn
0  Deepesh  101
1   Dinesh  102
2   Jaison  103
3      sai  104
4  pratham  105

In [8]:
df2

   usn  marks
0  101     56
1  102     57
2  103     58

In [9]:
df3=pd.merge(df1,df2,how='inner',on='usn')

In [10]:
df3

   student  usn  marks
0  Deepesh  101     56
1   Dinesh  102     57
2   Jaison  103     58

In [11]:
df4=pd.merge(df1,df2,how="left",on="usn")

In [12]:
df4

   student  usn  marks
0  Deepesh  101   56.0
1   Dinesh  102   57.0
2   Jaison  103   58.0
3      sai  104    NaN
4  pratham  105    NaN

In [13]:
df5=pd.merge(df1,df2,how="right",on="usn")
df5

   student  usn  marks
0  Deepesh  101     56
1   Dinesh  102     57
2   Jaison  103     58